Revit 2015 API
EnergyAnalysisOpening Members
The EnergyAnalysisOpening type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the EnergyAnalysisOpening
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalSurface
 Gets the associative analytical parent surface element.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPolyloop
 Gets the planar polygon describing the opening geometry.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CADLinkUniqueId
 The unique id of the originating CAD object's link (linked document) associated with this opening.
CADObjectUniqueId
 The unique id of the originating CAD object (model element) associated with this opening.
Corner
 The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height
 The height of the analytical rectangular geometry.
Id
 The unique identifier for the opening.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The unique name identifier for the opening.
OpeningType
 The analytical opening type.
OriginatingElementDescription
 The description for the originating Revit element.
OriginatingElementId |  Obsolete.
 The element id for the originating Revit element.
Type
 The gbXML opening type attribute.
Width
 The width of the analytical rectangular geometry.
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace